🚀&nbsp; env0 had composed a PR Plan for environment [Terraform Example / production ](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50):
```
Plan: 1 to add, 2 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:


  # module.api_server.aws_cloudwatch_metric_alarm.cpu_credits[0] will be created
+   resource "aws_cloudwatch_metric_alarm" "cpu_credits" {
+       actions_enabled                       = true
+       alarm_actions                         = [
+           "arn:aws:sns:eu-west-2:540044833068:api-51c748b4-alerts",
        ]
+       alarm_description                     = "CPU credit balance is low"
+       alarm_name                            = "api-51c748b4-cpu-credits-low"
+       arn                                   = (known after apply)
+       comparison_operator                   = "LessThanThreshold"
+       dimensions                            = {
+           "InstanceId" = "i-0d1d4384862781a22"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 2
+       id                                    = (known after apply)
+       metric_name                           = "CPUCreditBalance"
+       namespace                             = "AWS/EC2"
+       ok_actions                            = [
+           "arn:aws:sns:eu-west-2:540044833068:api-51c748b4-alerts",
        ]
+       period                                = 300
+       statistic                             = "Average"
+       tags                                  = {
+           "CostCenter"  = "engineering"
+           "Environment" = "production"
+           "ManagedBy"   = "terraform"
+           "Name"        = "api-51c748b4-credits-alarm"
+           "Project"     = "api-platform"
+           "Workload"    = "cpu-intensive"
        }
+       tags_all                              = {
+           "CostCenter"  = "engineering"
+           "Environment" = "production"
+           "ManagedBy"   = "terraform"
+           "Name"        = "api-51c748b4-credits-alarm"
+           "Project"     = "api-platform"
+           "Workload"    = "cpu-intensive"
        }
+       threshold                             = 50
+       treat_missing_data                    = "missing"
    }

  # module.api_server.aws_instance.api_server[0] will be updated in-place
!   resource "aws_instance" "api_server" {
        id                                   = "i-0d1d4384862781a22"
!       instance_type                        = "c5.large" -> "t3.large"
!       public_dns                           = "ec2-35-178-48-219.eu-west-2.compute.amazonaws.com" -> (known after apply)
!       public_ip                            = "35.178.48.219" -> (known after apply)
        tags                                 = {
            "CostCenter"  = "engineering"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "api-51c748b4-api-server"
            "Project"     = "api-platform"
            "Workload"    = "cpu-intensive"
        }
!       user_data                            = "627f06eeee1e41f87d9e55ae56203ae81058d890" -> "c90db9c10d62169f9765b60bd7231ab437966fd9"
        # (29 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.heritage[0].aws_rds_cluster.face_database will be updated in-place
!   resource "aws_rds_cluster" "face_database" {
        id                                    = "facial-recognition-terraform-example"
        tags                                  = {}
        # (46 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```
</details>


```
Monthly cost change for overmindtech/terraform-example/env0_tf_plan.json
Amount:  -$5 ($390 → $385)
Percent: -1%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: overmindtech/terraform-example/env0_tf_plan.json

+ module.api_server.aws_cloudwatch_metric_alarm.cpu_credits[0]
  +$0.10

+     Standard resolution
      +$0.10

! module.api_server.aws_instance.api_server[0]
  -$5 ($74 → $70)

!     Instance usage (Linux/UNIX, on-demand, c5.large → t3.large)
      -$5 ($74 → $69)

Monthly cost change for overmindtech/terraform-example/env0_tf_plan.json
Amount:  -$5 ($390 → $385)
Percent: -1%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

150 cloud resources were detected:
∙ 52 were estimated
∙ 96 were free
∙ 2 are not supported yet, see https://infracost.io/requested-resources:
  ∙ 1 x aws_cloudfront_monitoring_subscription
  ∙ 1 x aws_cloudwatch_query_definition

Infracost estimate: Monthly estimate decreased by $5 ↓
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ overmindtech/terraform-example/env0_tf_plan.json   ┃           -$5 ┃           - ┃    -$5 (-1%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2/deployments/b5d87b42-b375-426a-a2d2-a6fbc992ab4a?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50)
